; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 374093 2 2 4 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	Star6 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	Star2 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(have_image Phenomenon7 image2)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 infrared3)
	(have_image Star10 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 0 of 4
4. (turn_to satellite1 star2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star2)
   goals met: 0 of 4
5. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 4
6. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   goals met: 0 of 4
7. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 4
9. (take_image satellite1 star8 instrument2 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 1 of 4
10. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 4
11. (turn_to satellite1 phenomenon9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 4
12. (turn_to satellite0 star10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star10)
   goals met: 1 of 4
13. (take_image satellite1 phenomenon9 instrument2 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 2 of 4
14. (take_image satellite0 star10 instrument0 image2)
   added: (have_image star10 image2)
   goals met: 3 of 4
15. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 4
16. (turn_to satellite0 phenomenon7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 4
17. (take_image satellite0 phenomenon7 instrument0 image2)
   added: (have_image phenomenon7 image2)
   goals met: 4 of 4
